NASA-AMMOS/VICAR/vos/mars/inc/M2020MedaEdr.h
/*
       Copyright 2017-Present, California Institute of Technology. 
       ALL RIGHTS RESERVED.
       U.S. Government Sponsorship acknowledge.
*/

/**
 * @author Stirling Algermissen (Stirling.S.Algermissen@jpl.nasa.gov)
 */
#ifndef M2020MEDAEDR_H_
#define M2020MEDAEDR_H_
#include "M2020Edr.h"
#include "M2020EngCamEdr.h"
#include "M2020MedaPds.h"
#include <vector>
#include <list>
#include <stdio.h>
#include <stdint.h>
#include <cstring>
#include "M2020Env.h"
#include <sstream>
#include <iomanip>
#include <boost/uuid/uuid.hpp>            // uuid class
#include <boost/uuid/uuid_generators.hpp> // generators
#include <boost/uuid/uuid_io.hpp>         // streaming operators etc.

// set the first n bits to 1, rest to 0
#define BITMASK1(n) ((1ULL << (n)) - 1ULL)
// set bits [k+1, n] to 1, rest to 0
#define BITMASK(n, k) ((BITMASK1(n) >> k) << k)


using namespace std;

class M2020MedaPds;

class M2020MedaEdr:public M2020Edr {
   protected:
  string lastDbTableInsert = "";
  int lastDbTableInsertChannel = -1;
  bool closeLastInsert = false;
  sql::PreparedStatement *lastInsertStatement;
  
  string lastDbTableUpdate = "";
  int lastDbTableUpdateChannel = -1;
  bool closeLastUpdate = false;
  sql::PreparedStatement *lastUpdateStatement;
  
  sql::PreparedStatement *lastSelectStatement;

  unsigned int rawDataLength_;
  unsigned int fileSize_;
  M2020MedaPds *pdsLabel_;
  M2020IdphHeader *hdr_;
  M2020IdphHeader *medaAncHdr_;

  boost::uuids::random_generator generator;
  
  std::map<std::string, std::vector<string>> sensorTableToSol;
  
  vector <DataDPO *> datasegs_;
  list <string> edrList_;
  
  virtual void init() throw(exception);
  virtual void setRawDataSize();
  
  virtual bool isHeader(const string & dpoName, int vid) const {
    TRACE;
    //  NUL as it's dpo parser.
    if (dpoName.find("DpoCidph") != std::string::npos)
      return true;
    else
      return false;
  } 
  virtual bool isAncHeader(const string & dpoName, int vid)const {
    return (dpoName.find("AncillarydataFrame") != std::string::npos);
  } 
  virtual M2020IdphHeader *createHeader(const string & dpoName, int vid, M2020DPOParser * dpoParser);
  virtual uint32_t fletcher32(unsigned char *data, size_t len, int offset);
  virtual void insertRecord(double acq_time, char* sourceProductId, int channelId, int value);
  //  virtual void insertRecord(double acq_time, char* sourceProductId, int channelId, string value, std::vector<std::vector<std::string>> lookupTable, string uuid);
  virtual void insertRecord(double acq_time, char* sourceProductId, int channelId, string value, std::vector<std::vector<std::string>> lookupTable, string uuid, string dataSource, int real_timestamp);
  virtual void writeMedaCsv(string dbTable, string sol);
  virtual void setInstrument(string dbTable, string sol);
  virtual string processErrorVal(unsigned char *data, std::vector<std::string> processArray);

  virtual string exec(const char* cmd);

 public:
  M2020MedaEdr(M2020DpMetaData *) throw(exception);
  virtual ~ M2020MedaEdr();
  
  virtual void process() throw(exception);
  virtual void checkUPFParams() throw(exception);
  virtual void checkDataFile() throw(exception);
  virtual void processDPOs() throw(exception);
  virtual void updateUPF() throw(exception);
  virtual void writeEdr(unsigned char *edrData, int length) throw(exception);
  virtual void finalize() throw(exception);
  //  template< typename T > string hexify(T i);
  template< typename T >
    std::string hexify(T i)
    {
      std::stringbuf buf;
      std::ostream os(&buf);
      // removed "0x" here before setfill due to MEDA request 
      os << std::setfill('0') << std::setw(sizeof(T) * 2)
	 << std::hex << i;
      
      return buf.str().c_str();
    }

  // which tables to enforce specific primary key ordering (EER products have multiple values per sclk)
  std::map<std::string, int> sensorToEer = {
    {"meda_ats", 0},
    {"meda_edac_def", 1},
    {"meda_edac_sef", 1},
    {"meda_flash_error", 1},
    {"meda_frangibolt_fire", 1},
    {"meda_hardfault_interrupt", 1},
    {"meda_hs", 0},
    {"meda_hs_maintenance", 0},
    {"meda_icu", 0},
    {"meda_ot_entry_fail", 1},
    {"meda_ps", 0},
    {"meda_rds", 0},
    {"meda_rds_telemetry", 1},
    {"meda_rds_uart_error", 1},
    {"meda_reset", 1},
    {"meda_rover_uart_error", 1},
    {"meda_skycam_uart_error", 1},
    {"meda_tirs", 0},
    {"meda_tirs_heaters_current_monitor", 1},
    {"meda_ws_asic_fail", 1},
    {"meda_ws_boom1", 0},
    {"meda_ws_boom2", 0},
    {"meda_ws_uart_error", 1},       
  };
  
  // map sensor table to select query for csv generation
  std::map<std::string, std::string> sensorToSelect = {
    {"meda_ws_boom1", "SELECT meda_ws_boom1.SCLK,"
     "meda_ws_boom1.LMST,"
     "meda_ws_boom1.LTST,"
     "meda_ws_boom1.sourceProductId,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_1,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_2,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_3,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_4,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_5,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_6,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_7,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_8,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_9,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_10,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_11,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_Sigma_Delta_12,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_1,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_2,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_3,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_4,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_5,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_6,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_7,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_8,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_9,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_LowGainCal_10,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_LowGainCal_50,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_LowGainCal_90,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_HighGainCal_10,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_HighGainCal_50,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_HighGainCal_90,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_DAC1,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_DAC2,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_DAC3,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_AVDD,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_IntTemp,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_1_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_2_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_3_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_4_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_5_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_6_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_7_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_8_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_ExtCh_9_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_LwGc_10_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_LwGc_50_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_LwGc_90_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_HhGc_10_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_HhGc_50_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_HhGc_90_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_DAC1_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_DAC2_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_DAC3_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_AVDD_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_IntTemp_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_WIND_DAC1,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_WIND_DAC2,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_WIND_DAC3,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_1,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_2,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_3,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_4,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_5,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_6,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_7,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_8,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_9,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_10,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_11,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_Sigma_Delta_12,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_1,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_2,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_3,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_4,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_5,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_6,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_7,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_8,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_9,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_LowGainCal_10,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_LowGainCal_50,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_LowGainCal_90,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_HighGainCal_10,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_HighGainCal_50,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_HighGainCal_90,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_DAC1,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_DAC2,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_DAC3,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_AVDD,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_IntTemp,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_1_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_2_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_3_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_4_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_5_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_6_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_7_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_8_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_ExtCh_9_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_LwGc_10_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_LwGc_50_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_LwGc_90_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_HhGc_10_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_HhGc_50_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_HhGc_90_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_DAC1_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_DAC2_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_DAC3_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_AVDD_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_IntTemp_status,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_WIND_DAC1,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_WIND_DAC2,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_WIND_DAC3,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_TR1_Ctrl_Alg_State,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_TR2_Ctrl_Alg_State,"
     "meda_ws_boom1.WS_BOOM1_ASIC1_TR3_Ctrl_Alg_State,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_TR1_Ctrl_Alg_State,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_TR2_Ctrl_Alg_State,"
     "meda_ws_boom1.WS_BOOM1_ASIC2_TR3_Ctrl_Alg_State"
     " FROM meda_ws_boom1 where sol="},
    {"meda_ws_boom2", "SELECT meda_ws_boom2.SCLK,"
     "meda_ws_boom2.LMST,"
     "meda_ws_boom2.LTST,"
     "meda_ws_boom2.sourceProductId,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_1,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_2,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_3,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_4,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_5,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_6,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_7,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_8,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_9,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_10,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_11,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_Sigma_Delta_12,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_1,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_2,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_3,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_4,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_5,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_6,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_7,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_8,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_9,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_LowGainCal_10,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_LowGainCal_50,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_LowGainCal_90,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_HighGainCal_10,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_HighGainCal_50,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_HighGainCal_90,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_DAC1,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_DAC2,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_DAC3,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_AVDD,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_IntTemp,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_1_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_2_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_3_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_4_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_5_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_6_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_7_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_8_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_ExtCh_9_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_LwGc_10_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_LwGc_50_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_LwGc_90_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_HhGc_10_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_HhGc_50_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_HhGc_90_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_DAC1_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_DAC2_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_DAC3_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_AVDD_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_IntTemp_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_WIND_DAC1,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_WIND_DAC2,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_WIND_DAC3,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_1,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_2,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_3,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_4,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_5,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_6,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_7,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_8,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_9,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_10,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_11,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_Sigma_Delta_12,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_1,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_2,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_3,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_4,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_5,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_6,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_7,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_8,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_9,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_LowGainCal_10,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_LowGainCal_50,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_LowGainCal_90,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_HighGainCal_10,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_HighGainCal_50,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_HighGainCal_90,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_DAC1,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_DAC2,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_DAC3,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_AVDD,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_IntTemp,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_1_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_2_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_3_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_4_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_5_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_6_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_7_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_8_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_ExtCh_9_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_LwGc_10_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_LwGc_50_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_LwGc_90_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_HhGc_10_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_HhGc_50_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_HhGc_90_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_DAC1_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_DAC2_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_DAC3_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_AVDD_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_IntTemp_status,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_WIND_DAC1,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_WIND_DAC2,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_WIND_DAC3,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_TR1_Ctrl_Alg_State,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_TR2_Ctrl_Alg_State,"
     "meda_ws_boom2.WS_BOOM2_ASIC1_TR3_Ctrl_Alg_State,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_TR1_Ctrl_Alg_State,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_TR2_Ctrl_Alg_State,"
     "meda_ws_boom2.WS_BOOM2_ASIC2_TR3_Ctrl_Alg_State"
     " FROM meda_ws_boom2 where sol="},
    {"meda_ats", "SELECT meda_ats.SCLK,"
      "meda_ats.LMST,"
      "meda_ats.LTST,"
      "meda_ats.sourceProductId,"
      "meda_ats.ATS_ATS1,"
      "meda_ats.ATS_ATS2,"
      "meda_ats.ATS_ATS3,"
      "meda_ats.ATS_ATS4,"
      "meda_ats.ATS_ATS5,"
      "meda_ats.ATS_ATS1_PRT,"
      "meda_ats.ATS_ATS2_PRT,"
      "meda_ats.ATS_ATS3_PRT,"
      "meda_ats.ATS_ATS4_PRT,"
      "meda_ats.ATS_ATS5_PRT"
      " FROM meda_ats where sol="},
     {"meda_hs", "SELECT meda_hs.SCLK,"
      "meda_hs.LMST,"		       
      "meda_hs.LTST,"		       
      "meda_hs.sourceProductId,"		       
      "meda_hs.HS_H_CHANNEL_CH1,"	       
      "meda_hs.HS_H_CHANNEL_CH2,"	       
      "meda_hs.HS_H_CHANNEL_CH3,"	       
      "meda_hs.HS_H_CHANNEL_CH4,"	       
      "meda_hs.HS_H_CHANNEL_CH5,"	       
      "meda_hs.HS_H_CHANNEL_CH6,"	       
      "meda_hs.HS_H_CHANNEL_CH7,"	       
      "meda_hs.HS_H_CHANNEL_CH8,"	       
      "meda_hs.HS_H_H_CONF1,"	       
      "meda_hs.HS_H_H_CONF2"
      " FROM meda_hs where sol="},
     {"meda_icu", "SELECT meda_icu.SCLK,"
      "meda_icu.LMST,"
      "meda_icu.LTST,"
      "meda_icu.sourceProductId,"
      "meda_icu.ICU_Analog_TH_HK_TM,"
      "meda_icu.ICU_Analog_H_PRT_TEMP_1,"
      "meda_icu.ICU_Analog_TIRS_ACQ_TEMP_TM,"	
      "meda_icu.ICU_Analog_5V_CURRENT_TM,"
      "meda_icu.ICU_Analog_8V_CURRENT_TM,"
      "meda_icu.ICU_Analog_11VN_CURRENT_TM,"
      "meda_icu.ICU_Analog_3V3_HK_MUX,"
      "meda_icu.ICU_Analog_POWER_H_SENSE,"
      "meda_icu.ICU_Analog_POWER_P1,"
      "meda_icu.ICU_Analog_R1_CAL_PRT,"
      "meda_icu.ICU_Analog_POWER_P2,"
      "meda_icu.ICU_Analog_R2_CAL_PRT,"
      "meda_icu.ICU_Analog_8V_FRANGI_TM,"
      "meda_icu.ICU_Analog_MEDA_RDS_TEMP,"
      "meda_icu.ICU_Analog_B1_SEC_PWR_TLM,"
      "meda_icu.ICU_Analog_CAM_PCB_PRT,"
      "meda_icu.ICU_Analog_B2_SEC_PWR_TLM,"
      "meda_icu.ICU_Analog_CAM_CCD_PRT,"
      "meda_icu.ICU_Analog_8V_H_PRT_TM,"
      "meda_icu.ICU_Analog_H_PRT_TEMP_2,"
      "meda_icu.ICU_Analog_12V_HTR_CURRENT_TM,"
      "meda_icu.ICU_Analog_WS1_PRT,"
      "meda_icu.ICU_Analog_WS2_PRT"
      " FROM meda_icu where sol="},
     {"meda_ps", "SELECT meda_ps.SCLK,"
      "meda_ps.LMST,"		       
      "meda_ps.LTST,"		       
      "meda_ps.sourceProductId,"		       
      "meda_ps.PS_P_CHANNEL_CH1,"	       
      "meda_ps.PS_P_CHANNEL_CH2,"	       
      "meda_ps.PS_P_CHANNEL_CH3,"	       
      "meda_ps.PS_P_CHANNEL_CH4,"	       
      "meda_ps.PS_P_CHANNEL_CH5,"	       
      "meda_ps.PS_P_CHANNEL_CH6,"
      "meda_ps.PS_P_CHANNEL_CH7,"
      "meda_ps.PS_P_CHANNEL_CH8,"
      "meda_ps.PS_PCONF_1,"
      "meda_ps.PS_PCONF_2"
      " FROM meda_ps where sol="
     },
     {"meda_rds", "SELECT meda_rds.SCLK,"
      "meda_rds.LMST,"
      "meda_rds.LTST,"
      "meda_rds.sourceProductId,"
      "meda_rds.RDS_CUMULATE_NUMBER,"
      "meda_rds.RDS_LAT_SE_1_PSTD,"
      "meda_rds.RDS_LAT_SE_1_ACCUM,"
      "meda_rds.RDS_LAT_SE_2_PSTD,"
      "meda_rds.RDS_LAT_SE_2_ACCUM,"
      "meda_rds.RDS_LAT_SE_3_PSTD,"
      "meda_rds.RDS_LAT_SE_3_ACCUM,"
      "meda_rds.RDS_LAT_SE_4_PSTD,"
      "meda_rds.RDS_LAT_SE_4_ACCUM,"
      "meda_rds.RDS_LAT_SE_5_PSTD,"
      "meda_rds.RDS_LAT_SE_5_ACCUM,"
      "meda_rds.RDS_LAT_SE_6_PSTD,"
      "meda_rds.RDS_LAT_SE_6_ACCUM,"
      "meda_rds.RDS_LAT_SE_7_PSTD,"
      "meda_rds.RDS_LAT_SE_7_ACCUM,"
      "meda_rds.RDS_LAT_SE_8_PSTD,"
      "meda_rds.RDS_LAT_SE_8_ACCUM,"
      "meda_rds.RDS_TOP_SE_1_PSTD,"
      "meda_rds.RDS_TOP_SE_1_ACCUM,"
      "meda_rds.RDS_TOP_SE_2_PSTD,"
      "meda_rds.RDS_TOP_SE_2_ACCUM,"
      "meda_rds.RDS_TOP_SE_3_PSTD,"
      "meda_rds.RDS_TOP_SE_3_ACCUM,"
      "meda_rds.RDS_TOP_SE_4_PSTD,"
      "meda_rds.RDS_TOP_SE_4_ACCUM,"
      "meda_rds.RDS_TOP_SE_5_PSTD,"
      "meda_rds.RDS_TOP_SE_5_ACCUM,"
      "meda_rds.RDS_TOP_SE_6_PSTD,"
      "meda_rds.RDS_TOP_SE_6_ACCUM,"
      "meda_rds.RDS_TOP_SE_7_PSTD,"
      "meda_rds.RDS_TOP_SE_7_ACCUM,"
      "meda_rds.RDS_TOP_SE_8_PSTD,"
      "meda_rds.RDS_TOP_SE_8_ACCUM,"
      "meda_rds.RDS_LAT_SE_1_HG_PSTD,"
      "meda_rds.RDS_LAT_SE_1_HG_ACCUM,"
      "meda_rds.RDS_LAT_SE_2_HG_PSTD,"
      "meda_rds.RDS_LAT_SE_2_HG_ACCUM,"
      "meda_rds.RDS_LAT_SE_3_HG_PSTD,"
      "meda_rds.RDS_LAT_SE_3_HG_ACCUM,"
      "meda_rds.RDS_LAT_SE_4_HG_PSTD,"
      "meda_rds.RDS_LAT_SE_4_HG_ACCUM,"
      "meda_rds.RDS_LAT_SE_5_HG_PSTD,"
      "meda_rds.RDS_LAT_SE_5_HG_ACCUM,"
      "meda_rds.RDS_LAT_SE_6_HG_PSTD,"
      "meda_rds.RDS_LAT_SE_6_HG_ACCUM,"
      "meda_rds.RDS_LAT_SE_7_HG_PSTD,"
      "meda_rds.RDS_LAT_SE_7_HG_ACCUM,"
      "meda_rds.RDS_LAT_SE_8_HG_PSTD,"
      "meda_rds.RDS_LAT_SE_8_HG_ACCUM,"
      "meda_rds.RDS_TOP_SE_1_HG_PSTD,"
      "meda_rds.RDS_TOP_SE_1_HG_ACCUM,"
      "meda_rds.RDS_TOP_SE_2_HG_PSTD,"
      "meda_rds.RDS_TOP_SE_2_HG_ACCUM,"
      "meda_rds.RDS_TOP_SE_3_HG_PSTD,"
      "meda_rds.RDS_TOP_SE_3_HG_ACCUM,"
      "meda_rds.RDS_TOP_SE_4_HG_PSTD,"
      "meda_rds.RDS_TOP_SE_4_HG_ACCUM,"
      "meda_rds.RDS_TOP_SE_5_HG_PSTD,"
      "meda_rds.RDS_TOP_SE_5_HG_ACCUM,"
      "meda_rds.RDS_TOP_SE_6_HG_PSTD,"
      "meda_rds.RDS_TOP_SE_6_HG_ACCUM,"
      "meda_rds.RDS_TOP_SE_7_HG_PSTD,"
      "meda_rds.RDS_TOP_SE_7_HG_ACCUM,"
      "meda_rds.RDS_TOP_SE_8_HG_PSTD,"
      "meda_rds.RDS_TOP_SE_8_HG_ACCUM,"
      "meda_rds.RDS_LAT_TMP_2_PSTD,"
      "meda_rds.RDS_LAT_TMP_2_ACCUM,"
      "meda_rds.RDS_LAT_TMP_4_PSTD,"
      "meda_rds.RDS_LAT_TMP_4_ACCUM,"
      "meda_rds.RDS_LAT_TMP_6_PSTD,"
      "meda_rds.RDS_LAT_TMP_6_ACCUM,"
      "meda_rds.RDS_LAT_TMP_8_PSTD,"
      "meda_rds.RDS_LAT_TMP_8_ACCUM,"
      "meda_rds.RDS_TOP_TMP_1_PSTD,"
      "meda_rds.RDS_TOP_TMP_1_ACCUM,"
      "meda_rds.RDS_TOP_TMP_3_PSTD,"
      "meda_rds.RDS_TOP_TMP_3_ACCUM,"
      "meda_rds.RDS_TOP_TMP_5_PSTD,"
      "meda_rds.RDS_TOP_TMP_5_ACCUM,"
      "meda_rds.RDS_TOP_TMP_7_PSTD,"
      "meda_rds.RDS_TOP_TMP_7_ACCUM,"
      "meda_rds.RDS_INT_SENSE_5V_IN_PSTD,"
      "meda_rds.RDS_INT_SENSE_5V_IN_ACCUM,"
      "meda_rds.RDS_INT_SENSE_5V_DIG_PSTD,"
      "meda_rds.RDS_INT_SENSE_5V_DIG_ACCUM,"
      "meda_rds.RDS_INT_TMP_DD_PSTD,"
      "meda_rds.RDS_INT_TMP_DD_ACCUM,"
      "meda_rds.RDS_INT_SE_DD_PSTD,"
      "meda_rds.RDS_INT_SE_DD_ACCUM,"
      "meda_rds.RDS_INT_REF_DD_PSTD,"
      "meda_rds.RDS_INT_REF_DD_ACCUM,"
      "meda_rds.RDS_INT_REF_TIA_PSTD,"
      "meda_rds.RDS_INT_REF_TIA_ACCUM,"
      "meda_rds.RDS_INT_TMP_PE_PSTD,"
      "meda_rds.RDS_INT_TMP_PE_ACCUM"
      " FROM meda_rds where sol="},
    {"meda_tirs", "SELECT meda_tirs.SCLK,"
     "meda_tirs.LMST,"
     "meda_tirs.LTST,"
     "meda_tirs.sourceProductId,"
     "meda_tirs.TIRS_TIRS1_avg,"
     "meda_tirs.TIRS_TIRS2_avg,"
     "meda_tirs.TIRS_TIRS3_avg,"
     "meda_tirs.TIRS_TIRS4_avg,"
     "meda_tirs.TIRS_TIRS5_avg,"
     "meda_tirs.TIRS_SUP_1_PLATE_PRT_avg,"
     "meda_tirs.TIRS_SUP_2_PLATE_PRT_avg,"
     "meda_tirs.TIRS_CAL_PLATE_PRT_avg,"
     "meda_tirs.TIRS_HEATER_PWM"
     " FROM meda_tirs where sol="},
    {"meda_reset", "SELECT `meda_reset`.`SCLK`,\n"
"    `meda_reset`.`LMST`,\n"
"    `meda_reset`.`LTST`,\n"
"    IF(`meda_reset`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_reset`.`sourceProductId`,\n"
"    `meda_reset`.`Data_Source`,\n"
"    `meda_reset`.`Reset_Source`,\n"
"    `meda_reset`.`SUSW_Test_Performed`,\n"
"    `meda_reset`.`SUSW_Test_Result`,\n"
"    `meda_reset`.`APSW_Test_Performed`,\n"
"    `meda_reset`.`APSW_Test_Result`,\n"
