NASA-AMMOS/VICAR/vos/mars/inc/M2020MedaEdr.h
"    `meda_reset`.`Proc_RAM_test_first_fail_address`,\n"
"    `meda_reset`.`Proc_RAM_test_first_fail_expected_value`,\n"
"    `meda_reset`.`Proc_RAM_test_first_fail_value_read`,\n"
"    `meda_reset`.`PROM_expected_checksum`,\n"
"    `meda_reset`.`PROM_calculated_checksum`,\n"
"    `meda_reset`.`MMP_expected_checksum`,\n"
"    `meda_reset`.`MMP_calculated_checksum`,\n"
"    `meda_reset`.`MMP_Voted_Address`,\n"
"    `meda_reset`.`APSW_Image1_expected_checksum`,\n"
"    `meda_reset`.`APSW_Image1_calculated_checksum`,\n"
"    `meda_reset`.`APSW_Image1_Version`,\n"
"    `meda_reset`.`APSW_Image2_expected_checksum`,\n"
"    `meda_reset`.`APSW_Image2_calculated_checksum`,\n"
"    `meda_reset`.`APSW_Image2_Version`,\n"
"    `meda_reset`.`Default_APSW_image`,\n"
"    `meda_reset`.`APSW_RAM_Checksum_Test_Performed`,\n"
"    `meda_reset`.`APSW_RAM_Checksum_Test_Result`,\n"
"    `meda_reset`.`Executable_APSW_image`,\n"
"    `meda_reset`.`SP_expected_checksum`,\n"
"    `meda_reset`.`SP_calculated_checksum`,\n"
"    `meda_reset`.`Persistent_Data_expected_checksum`,\n"
"    `meda_reset`.`Persistent_Data_calculated_checksum`,\n"
"    `meda_reset`.`OT1_expected_checksum`,\n"
"    `meda_reset`.`OT1_calculated_checksum`,\n"
"    `meda_reset`.`OT2_expected_checksum`,\n"
"    `meda_reset`.`OT2_calculated_checksum`,\n"
"    `meda_reset`.`OT3_expected_checksum`,\n"
"    `meda_reset`.`OT3_calculated_checksum`,\n"
"    `meda_reset`.`OT4_expected_checksum`,\n"
"    `meda_reset`.`OT4_calculated_checksum`,\n"
"    `meda_reset`.`OT5_expected_checksum`,\n"
"    `meda_reset`.`OT5_calculated_checksum`,\n"
"    `meda_reset`.`OT6_expected_checksum`,\n"
"    `meda_reset`.`OT6_calculated_checksum`,\n"
"    `meda_reset`.`OT7_expected_checksum`,\n"
"    `meda_reset`.`OT7_calculated_checksum`,\n"
"    `meda_reset`.`OT8_expected_checksum`,\n"
"    `meda_reset`.`OT8_calculated_checksum`,\n"
"    `meda_reset`.`OT9_expected_checksum`,\n"
"    `meda_reset`.`OT9_calculated_checksum`,\n"
"    `meda_reset`.`OT10_expected_checksum`,\n"
"    `meda_reset`.`OT10_calculated_checksum`,\n"
"    `meda_reset`.`OT11_expected_checksum`,\n"
"    `meda_reset`.`OT11_calculated_checksum`,\n"
"    `meda_reset`.`OT12_expected_checksum`,\n"
"    `meda_reset`.`OT12_calculated_checksum`,\n"
"    `meda_reset`.`OT13_expected_checksum`,\n"
"    `meda_reset`.`OT13_calculated_checksum`,\n"
"    `meda_reset`.`OT14_expected_checksum`,\n"
"    `meda_reset`.`OT14_calculated_checksum`,\n"
"    `meda_reset`.`OT15_expected_checksum`,\n"
"    `meda_reset`.`OT15_calculated_checksum`,\n"
"    `meda_reset`.`OT16_expected_checksum`,\n"
"    `meda_reset`.`OT16_calculated_checksum`,\n"
"    `meda_reset`.`SUSW_EDAC_SEF_Counter`,\n"
"    `meda_reset`.`SUSW_Last_SEF_Address`,\n"
"    `meda_reset`.`SUSW_EDAC_DEF_Counter`,\n"
"    `meda_reset`.`SUSW_Last_DEF_Address`,\n"
"    `meda_reset`.`SUSW_Hardfault_Interrupt_Counter`,\n"
"    `meda_reset`.`SUSW_Last_Hardfault_Error_Address`,\n"
"    `meda_reset`.`SUSW_Hardfault_ID`,\n"
"    `meda_reset`.`SUSWMaxCycle`,\n"
"    `meda_reset`.`SUSWMaxLoad`,\n"
"    `meda_reset`.`APSWMaxCycle0`,\n"
"    `meda_reset`.`APSWMaxCycle1`,\n"
"    `meda_reset`.`APSWMaxCycle2`,\n"
"    `meda_reset`.`APSWMaxCycle3`,\n"
"    `meda_reset`.`APSWMaxCycle4`,\n"
"    `meda_reset`.`APSWMaxCycle5`,\n"
"    `meda_reset`.`APSWMaxCycle6`,\n"
"    `meda_reset`.`APSWMaxCycle7`,\n"
"    `meda_reset`.`APSWMaxCycle8`,\n"
"    `meda_reset`.`APSWMaxCycle9`,\n"
"    `meda_reset`.`APSWMaxLoad`\n"
     "FROM `m2020edrgen_meda`.`meda_reset` where sol="},
    {"meda_ot_entry_fail", "SELECT `meda_ot_entry_fail`.`SCLK`,\n"
"    `meda_ot_entry_fail`.`LMST`,\n"
"    `meda_ot_entry_fail`.`LTST`,\n"
"    IF(`meda_ot_entry_fail`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_ot_entry_fail`.`sourceProductId`,\n"
"    `meda_ot_entry_fail`.`Failure_ID`,\n"
"    `meda_ot_entry_fail`.`OT_Entry`,\n"
"    `meda_ot_entry_fail`.`Failure_Cause`\n"
     "FROM `m2020edrgen_meda`.`meda_ot_entry_fail` WHERE sol="},
    {"meda_rover_uart_error", "SELECT `meda_rover_uart_error`.`SCLK`,\n"
"    `meda_rover_uart_error`.`LMST`,\n"
"    `meda_rover_uart_error`.`LTST`,\n"
"    IF(`meda_rover_uart_error`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_rover_uart_error`.`Real_Timestamp`,\n"
"    `meda_rover_uart_error`.`sourceProductId`,\n"
"    `meda_rover_uart_error`.`Rover_UART_Rx_Status_ORed`,\n"
"    `meda_rover_uart_error`.`Rover_UART_Tx_Status_ORed`\n"
     "FROM `m2020edrgen_meda`.`meda_rover_uart_error` WHERE sol="},
    {"meda_ws_uart_error", "SELECT `meda_ws_uart_error`.`SCLK`,\n"
"    `meda_ws_uart_error`.`LMST`,\n"
"    `meda_ws_uart_error`.`LTST`,\n"
"    IF(`meda_ws_uart_error`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_ws_uart_error`.`sourceProductId`,\n"
"    `meda_ws_uart_error`.`WS_ASIC_ID`,\n"
"    `meda_ws_uart_error`.`WS_UART_Status`,\n"
"    `meda_ws_uart_error`.`BOOM_SwitchedOFF_flag`\n"
     "FROM `m2020edrgen_meda`.`meda_ws_uart_error` WHERE sol="},
    {"meda_rds_uart_error", "SELECT `meda_rds_uart_error`.`SCLK`,\n"
"    `meda_rds_uart_error`.`LMST`,\n"
"    `meda_rds_uart_error`.`LTST`,\n"
"    IF(`meda_rds_uart_error`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_rds_uart_error`.`sourceProductId`,\n"
"    `meda_rds_uart_error`.`RDS_UART_Status`,\n"
"    `meda_rds_uart_error`.`RDS_SwitchedOFF_flag`,\n"
"    `meda_rds_uart_error`.`RDS_TCResponse`,\n"
"    `meda_rds_uart_error`.`RDS_Timeout`\n"
     "FROM `m2020edrgen_meda`.`meda_rds_uart_error` WHERE sol="},
    {"meda_skycam_uart_error", "SELECT `meda_skycam_uart_error`.`SCLK`,\n"
"    `meda_skycam_uart_error`.`LMST`,\n"
"    `meda_skycam_uart_error`.`LTST`,\n"
"    IF(`meda_skycam_uart_error`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_skycam_uart_error`.`sourceProductId`,\n"
"    `meda_skycam_uart_error`.`SkyCam_UART_Status`\n"
     "FROM `m2020edrgen_meda`.`meda_skycam_uart_error` WHERE sol="},
    {"meda_rds_telemetry", "SELECT `meda_rds_telemetry`.`SCLK`,\n"
"    `meda_rds_telemetry`.`LMST`,\n"
"    `meda_rds_telemetry`.`LTST`,\n"
"    IF(`meda_rds_telemetry`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_rds_telemetry`.`sourceProductId`,\n"
"    `meda_rds_telemetry`.`RDS_Telecommand`,\n"
"    `meda_rds_telemetry`.`RDS_TM`\n"
     "FROM `m2020edrgen_meda`.`meda_rds_telemetry` WHERE sol="},
    {"meda_edac_sef", "SELECT `meda_edac_sef`.`SCLK`,\n"
"    `meda_edac_sef`.`LMST`,\n"
"    `meda_edac_sef`.`LTST`,\n"
"    IF(`meda_edac_sef`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_edac_sef`.`sourceProductId`,\n"
"    `meda_edac_sef`.`SEF_Address`\n"
     "FROM `m2020edrgen_meda`.`meda_edac_sef` WHERE sol="},
    {"meda_edac_def", "SELECT `meda_edac_def`.`SCLK`,\n"
"    `meda_edac_def`.`LMST`,\n"
"    `meda_edac_def`.`LTST`,\n"
"    IF(`meda_edac_def`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_edac_def`.`sourceProductId`,\n"
"    `meda_edac_def`.`DEF_Address`\n"
     "FROM `m2020edrgen_meda`.`meda_edac_def` WHERE sol="},
    {"meda_hardfault_interrupt", "SELECT `meda_hardfault_interrupt`.`SCLK`,\n"
"    `meda_hardfault_interrupt`.`LMST`,\n"
"    `meda_hardfault_interrupt`.`LTST`,\n"
"    IF(`meda_hardfault_interrupt`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_hardfault_interrupt`.`sourceProductId`,\n"
"    `meda_hardfault_interrupt`.`Error_Address`\n"
     "FROM `m2020edrgen_meda`.`meda_hardfault_interrupt` WHERE sol="},
    {"meda_frangibolt_fire", "SELECT `meda_frangibolt_fire`.`SCLK`,\n"
"    `meda_frangibolt_fire`.`LMST`,\n"
"    `meda_frangibolt_fire`.`LTST`,\n"
"    IF(`meda_frangibolt_fire`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_frangibolt_fire`.`sourceProductId`,\n"
"    `meda_frangibolt_fire`.`Firing_Time`,\n"
"    `meda_frangibolt_fire`.`Frangibolt_Temperature`\n"
     "FROM `m2020edrgen_meda`.`meda_frangibolt_fire` WHERE sol="},
    {"meda_hs_maintenance", "SELECT `meda_hs_maintenance`.`SCLK`,\n"
"    `meda_hs_maintenance`.`LMST`,\n"
"    `meda_hs_maintenance`.`LTST`,\n"
"    IF(`meda_hs_maintenance`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_hs_maintenance`.`sourceProductId`,\n"
"    `meda_hs_maintenance`.`HS_Initial_TempRange_Min`,\n"
"    `meda_hs_maintenance`.`HS_Initial_TempRange_Max`,\n"
"    `meda_hs_maintenance`.`HS_PRT_Heater_Timeout`,\n"
"    `meda_hs_maintenance`.`HS_Max_Temp`,\n"
"    `meda_hs_maintenance`.`Max_Value_H_PRT_TEMP_1`,\n"
"    `meda_hs_maintenance`.`Time_Start_Maintenance`,\n"
"    `meda_hs_maintenance`.`Time_End_Maintenance`,\n"
"    `meda_hs_maintenance`.`Maintenance_End_Status`\n"
     "FROM `m2020edrgen_meda`.`meda_hs_maintenance` WHERE sol="},
    {"meda_flash_error", "SELECT `meda_flash_error`.`SCLK`,\n"
"    `meda_flash_error`.`LMST`,\n"
"    `meda_flash_error`.`LTST`,\n"
"    IF(`meda_flash_error`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_flash_error`.`sourceProductId`,\n"
"    `meda_flash_error`.`Logical_block`,\n"
"    `meda_flash_error`.`Physical_block`,\n"
"    `meda_flash_error`.`Chip`,\n"
"    `meda_flash_error`.`Block_ID`,\n"
"    `meda_flash_error`.`Physical_Page`\n"
     "FROM `m2020edrgen_meda`.`meda_flash_error` WHERE sol="},
    {"meda_tirs_heaters_current_monitor", "SELECT `meda_tirs_heaters_current_monitor`.`SCLK`,\n"
"    `meda_tirs_heaters_current_monitor`.`LMST`,\n"
"    `meda_tirs_heaters_current_monitor`.`LTST`,\n"
"    IF(`meda_tirs_heaters_current_monitor`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_tirs_heaters_current_monitor`.`sourceProductId`,\n"
"    `meda_tirs_heaters_current_monitor`.`Reading_12V_HTR_CURRENT_TM`\n"
     "FROM `m2020edrgen_meda`.`meda_tirs_heaters_current_monitor` WHERE sol="},
    {"meda_ws_asic_fail", "SELECT `meda_ws_asic_fail`.`SCLK`,\n"
"    `meda_ws_asic_fail`.`LMST`,\n"
"    `meda_ws_asic_fail`.`LTST`,\n"
"    IF(`meda_ws_asic_fail`.`Real_Timestamp`, 'true', 'false') Real_Timestamp,\n"
"    `meda_ws_asic_fail`.`sourceProductId`,\n"
"    `meda_ws_asic_fail`.`WS_ASIC_ID`,\n"
"    `meda_ws_asic_fail`.`WS_Response_Status`\n"
     "FROM `m2020edrgen_meda`.`meda_ws_asic_fail` WHERE sol="}
   };
   
   
