NASA-AMMOS/VICAR/vos/mars/inc/M2020MedaEdr.h
// Map channel numbers->instrument table, channel name
  std::vector<std::vector<std::string>> channelToDbLoc = {
     {"ICU_Analog_TH_HK_TM", "meda_icu"},
     {"ICU_Analog_H_PRT_TEMP_1", "meda_icu"},
     {"ICU_Analog_TIRS_ACQ_TEMP_TM", "meda_icu"},
     {"ICU_Analog_5V_CURRENT_TM", "meda_icu"},
     {"ICU_Analog_8V_CURRENT_TM", "meda_icu"},
     {"ICU_Analog_11VN_CURRENT_TM", "meda_icu"},
     {"ICU_Analog_3V3_HK_MUX", "meda_icu"},
     {"ICU_Analog_POWER_H_SENSE", "meda_icu"},
     {"ICU_Analog_POWER_P1", "meda_icu"},
     {"ICU_Analog_R1_CAL_PRT", "meda_icu"},
     {"ICU_Analog_POWER_P2", "meda_icu"},
     {"ICU_Analog_R2_CAL_PRT", "meda_icu"},
     {"ICU_Analog_8V_FRANGI_TM", "meda_icu"},
     {"ICU_Analog_MEDA_RDS_TEMP", "meda_icu"},
     {"ICU_Analog_B1_SEC_PWR_TLM", "meda_icu"},
     {"ICU_Analog_CAM_PCB_PRT", "meda_icu"},
     {"ICU_Analog_B2_SEC_PWR_TLM", "meda_icu"},
     {"ICU_Analog_CAM_CCD_PRT", "meda_icu"},
     {"ICU_Analog_8V_H_PRT_TM", "meda_icu"},
     {"ICU_Analog_H_PRT_TEMP_2", "meda_icu"},
     {"ICU_Analog_12V_HTR_CURRENT_TM", "meda_icu"},
     {"ICU_Analog_WS1_PRT", "meda_icu"},
     {"ICU_Analog_WS2_PRT", "meda_icu"},
     {"PS_P_CHANNEL_CH1", "meda_ps"},
     {"PS_P_CHANNEL_CH2", "meda_ps"},
     {"PS_P_CHANNEL_CH3", "meda_ps"},
     {"PS_P_CHANNEL_CH4", "meda_ps"},
     {"PS_P_CHANNEL_CH5", "meda_ps"},
     {"PS_P_CHANNEL_CH6", "meda_ps"},
     {"PS_P_CHANNEL_CH7", "meda_ps"},
     {"PS_P_CHANNEL_CH8", "meda_ps"},
     {"PS_PCONF_1", "meda_ps"},
     {"PS_PCONF_2", "meda_ps"},
     {"HS_H_CHANNEL_CH1", "meda_hs"},
     {"HS_H_CHANNEL_CH2", "meda_hs"},
     {"HS_H_CHANNEL_CH3", "meda_hs"},
     {"HS_H_CHANNEL_CH4", "meda_hs"},
     {"HS_H_CHANNEL_CH5", "meda_hs"},
     {"HS_H_CHANNEL_CH6", "meda_hs"},
     {"HS_H_CHANNEL_CH7", "meda_hs"},
     {"HS_H_CHANNEL_CH8", "meda_hs"},
     {"HS_H_H_CONF1", "meda_hs"},
     {"HS_H_H_CONF2", "meda_hs"},
     {"TIRS_TIRS1_avg", "meda_tirs"},
     {"TIRS_TIRS2_avg", "meda_tirs"},
     {"TIRS_TIRS3_avg", "meda_tirs"},
     {"TIRS_TIRS4_avg", "meda_tirs"},
     {"TIRS_TIRS5_avg", "meda_tirs"},
     {"TIRS_SUP_1_PLATE_PRT_avg", "meda_tirs"},
     {"TIRS_SUP_2_PLATE_PRT_avg", "meda_tirs"},
     {"TIRS_CAL_PLATE_PRT_avg", "meda_tirs"},
     {"TIRS_HEATER_PWM", "meda_tirs"},
     {"ATS_ATS1", "meda_ats"},
     {"ATS_ATS2", "meda_ats"},
     {"ATS_ATS3", "meda_ats"},
     {"ATS_ATS4", "meda_ats"},
     {"ATS_ATS5", "meda_ats"},
     {"ATS_ATS1_PRT", "meda_ats"},
     {"ATS_ATS2_PRT", "meda_ats"},
     {"ATS_ATS3_PRT", "meda_ats"},
     {"ATS_ATS4_PRT", "meda_ats"},
     {"ATS_ATS5_PRT", "meda_ats"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_1", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_2", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_3", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_4", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_5", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_6", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_7", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_8", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_9", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_10", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_11", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_Sigma_Delta_12", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_3", "meda_ws_boom1"}, // swapped with WS_BOOM1_ASIC1_ExtCh_1
     {"WS_BOOM1_ASIC1_ExtCh_2", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_1", "meda_ws_boom1"}, // swapped with WS_BOOM1_ASIC1_ExtCh_3
     {"WS_BOOM1_ASIC1_ExtCh_4", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_5", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_6", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_7", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_8", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_9", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_LowGainCal_10", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_LowGainCal_50", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_LowGainCal_90", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_HighGainCal_10", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_HighGainCal_50", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_HighGainCal_90", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_DAC1", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_DAC2", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_DAC3", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_AVDD", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_IntTemp", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_1_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_2_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_3_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_4_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_5_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_6_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_7_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_8_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_ExtCh_9_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_LwGc_10_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_LwGc_50_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_LwGc_90_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_HhGc_10_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_HhGc_50_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_HhGc_90_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_DAC1_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_DAC2_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_DAC3_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_AVDD_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_IntTemp_status", "meda_ws_boom1"},    
     {"WS_BOOM1_ASIC1_WIND_DAC1", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_WIND_DAC2", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_WIND_DAC3", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_1", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_2", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_3", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_4", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_5", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_6", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_7", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_8", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_9", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_10", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_11", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_Sigma_Delta_12", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_3", "meda_ws_boom1"}, // swapped with WS_BOOM1_ASIC2_ExtCh_1
     {"WS_BOOM1_ASIC2_ExtCh_2", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_1", "meda_ws_boom1"}, // swapped with WS_BOOM1_ASIC2_ExtCh_3
     {"WS_BOOM1_ASIC2_ExtCh_4", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_5", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_6", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_7", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_8", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_9", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_LowGainCal_10", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_LowGainCal_50", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_LowGainCal_90", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_HighGainCal_10", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_HighGainCal_50", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_HighGainCal_90", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_DAC1", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_DAC2", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_DAC3", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_AVDD", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_IntTemp", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_1_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_2_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_3_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_4_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_5_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_6_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_7_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_8_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_ExtCh_9_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_LwGc_10_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_LwGc_50_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_LwGc_90_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_HhGc_10_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_HhGc_50_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_HhGc_90_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_DAC1_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_DAC2_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_DAC3_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_AVDD_status", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_IntTemp_status", "meda_ws_boom1"},    
     {"WS_BOOM1_ASIC2_WIND_DAC1", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_WIND_DAC2", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_WIND_DAC3", "meda_ws_boom1"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_1", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_2", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_3", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_4", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_5", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_6", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_7", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_8", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_9", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_10", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_11", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_Sigma_Delta_12", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_3", "meda_ws_boom2"}, // swapped with WS_BOOM2_ASIC1_ExtCh_1
     {"WS_BOOM2_ASIC1_ExtCh_2", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_1", "meda_ws_boom2"}, // swapped with WS_BOOM2_ASIC1_ExtCh_3
     {"WS_BOOM2_ASIC1_ExtCh_4", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_5", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_6", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_7", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_8", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_9", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_LowGainCal_10", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_LowGainCal_50", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_LowGainCal_90", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_HighGainCal_10", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_HighGainCal_50", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_HighGainCal_90", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_DAC1", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_DAC2", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_DAC3", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_AVDD", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_IntTemp", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_1_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_2_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_3_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_4_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_5_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_6_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_7_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_8_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_ExtCh_9_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_LwGc_10_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_LwGc_50_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_LwGc_90_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_HhGc_10_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_HhGc_50_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_HhGc_90_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_DAC1_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_DAC2_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_DAC3_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_AVDD_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_IntTemp_status", "meda_ws_boom2"},    
     {"WS_BOOM2_ASIC1_WIND_DAC1", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_WIND_DAC2", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_WIND_DAC3", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_1", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_2", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_3", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_4", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_5", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_6", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_7", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_8", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_9", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_10", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_11", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_Sigma_Delta_12", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_3", "meda_ws_boom2"}, // swapped with WS_BOOM2_ASIC2_ExtCh_1
     {"WS_BOOM2_ASIC2_ExtCh_2", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_1", "meda_ws_boom2"}, // swapped with WS_BOOM2_ASIC2_ExtCh_3
     {"WS_BOOM2_ASIC2_ExtCh_4", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_5", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_6", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_7", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_8", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_9", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_LowGainCal_10", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_LowGainCal_50", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_LowGainCal_90", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_HighGainCal_10", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_HighGainCal_50", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_HighGainCal_90", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_DAC1", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_DAC2", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_DAC3", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_AVDD", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_IntTemp", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_1_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_2_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_3_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_4_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_5_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_6_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_7_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_8_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_ExtCh_9_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_LwGc_10_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_LwGc_50_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_LwGc_90_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_HhGc_10_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_HhGc_50_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_HhGc_90_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_DAC1_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_DAC2_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_DAC3_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_AVDD_status", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_IntTemp_status", "meda_ws_boom2"},    
     {"WS_BOOM2_ASIC2_WIND_DAC1", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_WIND_DAC2", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_WIND_DAC3", "meda_ws_boom2"},
     {"WS_BOOM1_ASIC1_TR1_Ctrl_Alg_State", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_TR2_Ctrl_Alg_State", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC1_TR3_Ctrl_Alg_State", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_TR1_Ctrl_Alg_State", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_TR2_Ctrl_Alg_State", "meda_ws_boom1"},
     {"WS_BOOM1_ASIC2_TR3_Ctrl_Alg_State", "meda_ws_boom1"},
     {"WS_BOOM2_ASIC1_TR1_Ctrl_Alg_State", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_TR2_Ctrl_Alg_State", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC1_TR3_Ctrl_Alg_State", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_TR1_Ctrl_Alg_State", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_TR2_Ctrl_Alg_State", "meda_ws_boom2"},
     {"WS_BOOM2_ASIC2_TR3_Ctrl_Alg_State", "meda_ws_boom2"},
     {"RDS_CUMULATE_NUMBER", "meda_rds"},
     {"RDS_LAT_SE_7_PSTD", "meda_rds"},
     {"RDS_LAT_SE_7_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_5_PSTD", "meda_rds"},
     {"RDS_LAT_SE_5_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_4_PSTD", "meda_rds"},
     {"RDS_LAT_SE_4_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_6_PSTD", "meda_rds"},
     {"RDS_LAT_SE_6_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_3_PSTD", "meda_rds"},
     {"RDS_LAT_SE_3_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_8_PSTD", "meda_rds"},
     {"RDS_LAT_SE_8_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_1_PSTD", "meda_rds"},
     {"RDS_LAT_SE_1_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_2_PSTD", "meda_rds"},
     {"RDS_LAT_SE_2_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_3_PSTD", "meda_rds"},
     {"RDS_TOP_SE_3_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_1_PSTD", "meda_rds"},
     {"RDS_TOP_SE_1_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_8_PSTD", "meda_rds"},
     {"RDS_TOP_SE_8_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_2_PSTD", "meda_rds"},
     {"RDS_TOP_SE_2_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_7_PSTD", "meda_rds"},
     {"RDS_TOP_SE_7_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_4_PSTD", "meda_rds"},
     {"RDS_TOP_SE_4_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_6_PSTD", "meda_rds"},
     {"RDS_TOP_SE_6_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_5_PSTD", "meda_rds"},
     {"RDS_TOP_SE_5_ACCUM", "meda_rds"},
     {"RDS_LAT_TMP_4_PSTD", "meda_rds"},
     {"RDS_LAT_TMP_4_ACCUM", "meda_rds"},
     {"RDS_LAT_TMP_2_PSTD", "meda_rds"},
     {"RDS_LAT_TMP_2_ACCUM", "meda_rds"},
     {"RDS_TOP_TMP_5_PSTD", "meda_rds"},
     {"RDS_TOP_TMP_5_ACCUM", "meda_rds"},
     {"RDS_TOP_TMP_3_PSTD", "meda_rds"},
     {"RDS_TOP_TMP_3_ACCUM", "meda_rds"},
     {"RDS_TOP_TMP_1_PSTD", "meda_rds"},
     {"RDS_TOP_TMP_1_ACCUM", "meda_rds"},
     {"RDS_LAT_TMP_8_PSTD", "meda_rds"},
     {"RDS_LAT_TMP_8_ACCUM", "meda_rds"},
     {"RDS_TOP_TMP_7_PSTD", "meda_rds"},
     {"RDS_TOP_TMP_7_ACCUM", "meda_rds"},
     {"RDS_LAT_TMP_6_PSTD", "meda_rds"},
     {"RDS_LAT_TMP_6_ACCUM", "meda_rds"},
     {"RDS_INT_SENSE_5V_IN_PSTD", "meda_rds"},
     {"RDS_INT_SENSE_5V_IN_ACCUM", "meda_rds"},
     {"RDS_INT_SENSE_5V_DIG_PSTD", "meda_rds"},
     {"RDS_INT_SENSE_5V_DIG_ACCUM", "meda_rds"},
     {"RDS_INT_TMP_DD_PSTD", "meda_rds"},
     {"RDS_INT_TMP_DD_ACCUM", "meda_rds"},
     {"RDS_INT_SE_DD_PSTD", "meda_rds"},
     {"RDS_INT_SE_DD_ACCUM", "meda_rds"},
     {"RDS_INT_REF_DD_PSTD", "meda_rds"},
     {"RDS_INT_REF_DD_ACCUM", "meda_rds"},
     {"RDS_INT_REF_TIA_PSTD", "meda_rds"},
     {"RDS_INT_REF_TIA_ACCUM", "meda_rds"},
     {"RDS_INT_TMP_PE_PSTD", "meda_rds"},
     {"RDS_INT_TMP_PE_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_7_HG_PSTD", "meda_rds"},
     {"RDS_LAT_SE_7_HG_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_5_HG_PSTD", "meda_rds"},
     {"RDS_LAT_SE_5_HG_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_4_HG_PSTD", "meda_rds"},
     {"RDS_LAT_SE_4_HG_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_6_HG_PSTD", "meda_rds"},
     {"RDS_LAT_SE_6_HG_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_3_HG_PSTD", "meda_rds"},
     {"RDS_LAT_SE_3_HG_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_8_HG_PSTD", "meda_rds"},
     {"RDS_LAT_SE_8_HG_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_1_HG_PSTD", "meda_rds"},
     {"RDS_LAT_SE_1_HG_ACCUM", "meda_rds"},
     {"RDS_LAT_SE_2_HG_PSTD", "meda_rds"},
     {"RDS_LAT_SE_2_HG_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_3_HG_PSTD", "meda_rds"},
     {"RDS_TOP_SE_3_HG_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_1_HG_PSTD", "meda_rds"},
     {"RDS_TOP_SE_1_HG_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_8_HG_PSTD", "meda_rds"},
     {"RDS_TOP_SE_8_HG_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_2_HG_PSTD", "meda_rds"},
     {"RDS_TOP_SE_2_HG_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_7_HG_PSTD", "meda_rds"},
     {"RDS_TOP_SE_7_HG_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_4_HG_PSTD", "meda_rds"},
     {"RDS_TOP_SE_4_HG_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_6_HG_PSTD", "meda_rds"},
     {"RDS_TOP_SE_6_HG_ACCUM", "meda_rds"},
     {"RDS_TOP_SE_5_HG_PSTD", "meda_rds"},
     {"RDS_TOP_SE_5_HG_ACCUM", "meda_rds"},
   };
   // resetOffsetToColumn
     //   std::string * resetOffsetToColumn[82][5] = {
   std::vector<std::vector<std::string>> resetOffsetToColumn = {
     {"Reset_Source", "meda_reset", "Unsigned_LE", "ASCII_String", "4"},
     {"SUSW_Test_Performed", "meda_reset", "Unsigned_LE", "ASCII_String", "4"},
     {"SUSW_Test_Result", "meda_reset", "Unsigned_LE", "ASCII_String", "4"},
     {"APSW_Test_Performed", "meda_reset", "Unsigned_LE", "ASCII_String", "4"},
     {"APSW_Test_Result", "meda_reset", "Unsigned_LE", "ASCII_String", "4"},
     {"Proc_RAM_test_first_fail_address", "meda_reset", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"Proc_RAM_test_first_fail_expected_value", "meda_reset", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"Proc_RAM_test_first_fail_value_read", "meda_reset", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"PROM_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"PROM_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"MMP_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"MMP_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"MMP_Voted_Address", "meda_reset", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"APSW_Image1_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"APSW_Image1_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"APSW_Image1_Version", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"APSW_Image2_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"APSW_Image2_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"APSW_Image2_Version", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"Default_APSW_image", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSW_RAM_Checksum_Test_Performed", "meda_reset", "Unsigned_LE", "ASCII_String", "4"},
     {"APSW_RAM_Checksum_Test_Result", "meda_reset", "Unsigned_LE", "ASCII_String", "4"},
     {"Executable_APSW_image", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"SP_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"SP_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"Persistent_Data_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"Persistent_Data_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"Spare", "meda_reset", "Ignored", "Ignored", "4"},
     {"Spare", "meda_reset", "Ignored", "Ignored", "4"},
     {"Spare", "meda_reset", "Ignored", "Ignored", "4"},
     {"OT1_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT1_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT2_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT2_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT3_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT3_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT4_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT4_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT5_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT5_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT6_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT6_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT7_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT7_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT8_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT8_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT9_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
