NASA-AMMOS/VICAR/vos/mars/inc/M2020MedaEdr.h
     {"OT9_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT10_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT10_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT11_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT11_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT12_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT12_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT13_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT13_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT14_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT14_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT15_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT15_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT16_expected_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"OT16_calculated_checksum", "meda_reset", "Unsigned_BE", "ASCII_Numeric_Base16", "4"},
     {"SUSW_EDAC_SEF_Counter", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"SUSW_Last_SEF_Address", "meda_reset", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"SUSW_EDAC_DEF_Counter", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"SUSW_Last_DEF_Address", "meda_reset", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"SUSW_Hardfault_Interrupt_Counter", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"SUSW_Last_Hardfault_Error_Address", "meda_reset", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"SUSW_Hardfault_ID", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"SUSWMaxCycle", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"SUSWMaxLoad", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle0", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle1", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle2", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle3", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle4", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle5", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle6", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle7", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle8", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxCycle9", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"},
     {"APSWMaxLoad", "meda_reset", "Unsigned_LE", "ASCII_Integer", "4"}
   };
   std::vector<std::vector<std::string>> otEntryFailOffsetToColumn = {
     {"Failure_ID", "meda_ot_entry_fail", "Unsigned_LE", "ASCII_Integer", "4"},
     {"OT_Entry", "meda_ot_entry_fail", "", "", "0"},
     {"Failure_Cause", "meda_ot_entry_fail", "", "", "0"}
   };
   std::vector<std::vector<std::string>> otEntryFailMapping = {
     {"Start_PS_Acq", "Start_PS_Acq on going"},
     {"Start_HS_Acq", "Start_HS_Acq on going"},
     {"HS_Maintenance", "Start_HS_Acq on going"},
     {"Start_TIRS_Acq", "Start_TIRS_Acq on going"},
     {"Start_TIRS_Support_Plate", "Start_TIRS_Support_Plate on going"},
     {"Start_WS_Acq", "Start_WS_Acq on going"},
     {"Start_RDS_Acq", "Start_RDS_Acq on going"},
     {"Start_RDS_Acq", "Start_RDS_HighGain on going"},
     {"Start_RDS_Acq", "Start_RDS_Debug on going"},
     {"Start_RDS_Acq", "After 3 switch ON tries failed"},
     {"Start_RDS_HighGain", "Start_RDS_Acq on going"},
     {"Start_RDS_HighGain", "Start_RDS_HighGain on going"},
     {"Start_RDS_HighGain", "Start_RDS_Debug on going"},
     {"Start_RDS_HighGain", "After 3 switch ON tries failed"},
     {"Start_RDS_Debug", "Start_RDS_Acq on going"},
     {"Start_RDS_Debug", "Start_RDS_HighGain on going"},
     {"Start_RDS_Debug", "Start_RDS_Debug on going"},
     {"Start_RDS_Debug", "After 3 switch ON tries failed"},
     {"SkyCam_Heater_SwitchON", "SkyCam ON"},
     {"SkyCam_SwitchON", "Skycam Temperature outside threshold range"},
     {"SkyCam_Heater_SwitchON", "Ongoing SkyCam acquisition initiated by TC"},
     {"SkyCam_Heater_SwitchOFF", "Ongoing SkyCam acquisition initiated by TC"},
     {"SkyCam_SwitchON", "Ongoing SkyCam acquisition initiated by TC"},
     {"SkyCam_SwitchOFF", "Ongoing SkyCam acquisition initiated by TC"},
     {"SkyCam_Acq", "Ongoing SkyCam acquisition initiated by TC"},
     {"HS_Maintenance", "Ongoing SkyCam acquisition initiated by TC"},
     {"TIRS_Cal_Heater", "Ongoing SkyCam acquisition initiated by TC"}
   };
   std::vector<std::vector<std::string>> roverUartOffsetToColumn = {
     {"Rover_UART_Rx_Status_ORed", "meda_rover_uart_error", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"Rover_UART_Tx_Status_ORed", "meda_rover_uart_error", "Unsigned_LE", "ASCII_Numeric_Base16", "4"}
   };
   std::vector<std::vector<std::string>> wsUartOffsetToColumn = {
     {"WS_ASIC_ID", "meda_ws_uart_error", "Unsigned_LE", "ASCII_Integer", "4"},
     {"WS_UART_Status", "meda_ws_uart_error", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"BOOM_SwitchedOFF_flag", "meda_ws_uart_error", "Unsigned_LE", "ASCII_Integer", "4"}
   };
   std::vector<std::vector<std::string>> rdsUartOffsetToColumn = {
     {"RDS_UART_Status", "meda_rds_uart_error", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
     {"RDS_SwitchedOFF_flag", "meda_rds_uart_error", "Unsigned_LE", "ASCII_Integer", "4"},
     {"RDS_TCResponse", "meda_rds_uart_error", "ByteArray", "ASCII_Numeric_Base16", "7"},
     {"RDS_Timeout", "meda_rds_uart_error", "Unsigned", "ASCII_Integer", "1"}
   };
   std::vector<std::vector<std::string>> skycamUartOffsetToColumn = {
     {"SkyCam_UART_Status", "meda_skycam_uart_error", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
   };
   std::vector<std::vector<std::string>> rdsTelemetryToColumn = {
     {"RDS_Telecommand", "meda_rds_telemetry", "ByteArray", "ASCII_Numeric_Base16", "8"},
     {"RDS_TM", "meda_rds_telemetry", "ByteArray", "ASCII_Numeric_Base16", "163"},
     {"Spare", "meda_rds_telemetry", "Ignored", "Ignored", "1"},
   };
   std::vector<std::vector<std::string>> edacSefToColumn = {
     {"SEF_Address", "meda_edac_sef", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
   };
   std::vector<std::vector<std::string>> edacDefToColumn = {
     {"DEF_Address", "meda_edac_def", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
   };
   std::vector<std::vector<std::string>> hardfaultInterruptToColumn = {
     {"Error_Address", "meda_hardfault_interrupt", "Unsigned_LE", "ASCII_Numeric_Base16", "4"},
   };
   std::vector<std::vector<std::string>> frangiboltFireToColumn = {
     {"Firing_Time", "meda_frangibolt_fire", "Unsigned_LE", "ASCII_Integer", "4"},
     {"Frangibolt_Temperature", "meda_frangibolt_fire", "Unsigned_LE", "ASCII_Integer", "4"},
     {"Spare", "meda_frangibolt_fire", "Ignored", "Ignored", "2"},
   };
   std::vector<std::vector<std::string>> hsMaintenanceToColumn = {
     {"HS_Initial_TempRange_Min", "meda_hs_maintenance", "Unsigned_LE", "ASCII_Integer", "2"},
     {"HS_Initial_TempRange_Max", "meda_hs_maintenance", "Unsigned_LE", "ASCII_Integer", "2"},
     {"HS_PRT_Heater_Timeout", "meda_hs_maintenance", "Unsigned_LE", "ASCII_Integer", "4"},
     {"HS_Max_Temp", "meda_hs_maintenance", "Unsigned_LE", "ASCII_Integer", "2"},
     {"Max_Value_H_PRT_TEMP_1", "meda_hs_maintenance", "Unsigned_LE", "ASCII_Integer", "2"},
     {"Time_Start_Maintenance", "meda_hs_maintenance", "Unsigned_LE", "ASCII_Integer", "4"},
     {"Time_End_Maintenance", "meda_hs_maintenance", "Unsigned_LE", "ASCII_Integer", "4"},
     {"Maintenance_End_Status", "meda_hs_maintenance", "Unsigned_LE", "ASCII_String", "4"}
   };
   std::vector<std::vector<std::string>> flashErrorToColumn = {
     {"Flash_Error_Type", "meda_flash_error", "Unsigned_LE", "ASCII_String", "2"},
     {"Logical_block", "meda_flash_error", "Unsigned_LE", "ASCII_Numeric_Base16", "2"},
     {"Physical_block", "meda_flash_error", "Unsigned_LE", "ASCII_Numeric_Base16", "2"},
     {"Chip", "meda_flash_error,Unsigned_LE", "ASCII_Numeric_Base16", "2"},
     {"Block_ID", "meda_flash_error,Unsigned_LE", "ASCII_Numeric_Base16", "2"},
     {"Physical_Page", "meda_flash_error,Unsigned_LE", "ASCII_Numeric_Base16", "2"}
   };
   std::vector<std::vector<std::string>> tirsHeatersCurrentMonitorToColumn = {
     {"Reading_12V_HTR_CURRENT_TM", "meda_tirs_heaters_current_monitor", "Unsigned_LE", "ASCII_Integer", "2"},
     {"Spare", "meda_tirs_heaters_current_monitor", "Ignored", "Ignored", "2"},     
   };
   std::vector<std::vector<std::string>> wsAsicFailToColumn = {
     {"WS_ASIC_ID", "meda_ws_asic_fail", "Unsigned_LE", "ASCII_Integer", "4"},
     {"WS_Response_Status", "meda_ws_asic_fail", "Unsigned_LE", "ASCII_Numeric_Base16", "4"}     
   };
   std::vector<std::vector<std::vector<std::string>>> medaErrorLookup = {
     resetOffsetToColumn,
     otEntryFailOffsetToColumn,
     roverUartOffsetToColumn,
     wsUartOffsetToColumn,
     rdsUartOffsetToColumn,
     skycamUartOffsetToColumn,
     rdsTelemetryToColumn,
     edacSefToColumn,
     edacDefToColumn,
     hardfaultInterruptToColumn,
     frangiboltFireToColumn,
     hsMaintenanceToColumn,
     flashErrorToColumn,
     tirsHeatersCurrentMonitorToColumn,
     wsAsicFailToColumn
   };
   int eventIdToSize [15] = { 328, 4, 8, 12, 16, 4, 172, 4, 4, 4, 8, 24, 12, 4, 8 }; 
};

#endif            /*M2020MEDAEDR_H_ */
